public/v1/quote/helpers/integrations/employers/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:wsdl="https://api.employers.com/DigitalAgencyServices/ws/AcordServices">
	<soapenv:Header/>
	<soapenv:Body>
		<wsdl:getWorkCompPolicy>
			<request>
				<appKey>TALAGE</appKey>
				<appToken>6e4fe5b9-c2ed-4286-a1ce-66ca49d4d379</appToken>
				<PolicyRq xmlns="http://www.acord.org/schema/PC/xml/2">
					<BusinessPurposeTypeCd>NBQ</BusinessPurposeTypeCd>
					<ItemIdInfo>
						<OtherIdentifier>
							<OtherIdTypeCd>Request</OtherIdTypeCd>
							<UID>d4089ba2-3c59-423c-9b32-53ffaf5a64e3</UID>
						</OtherIdentifier>
					</ItemIdInfo>
					<TransactionRequestDt>2020-01-28</TransactionRequestDt>
					<CurCd>USD</CurCd>
					<Producer>
						<ItemIdInfo>
							<AgencyId>0001032</AgencyId>
						</ItemIdInfo>
						<ProducerInfo>
							<ProducerInfoExt Domain="com.employers.digitalagencyservices.acordservice">
								<AgentId>0001032-CR00018180</AgentId>
							</ProducerInfoExt>
						</ProducerInfo>
					</Producer>
					<InsuredOrPrincipal>
						<GeneralPartyInfo>
							<NameInfo>
								<CommlName>
									<CommercialName>Talage NV Check 20200129 002145</CommercialName>
								</CommlName>
								<LegalEntityCd>CP</LegalEntityCd>
								<TaxIdentity>
									<TaxIdTypeCd>FEIN</TaxIdTypeCd>
									<TaxId>454795544</TaxId>
								</TaxIdentity>
							</NameInfo>
							<Addr>
								<AddrTypeCd>MailingAddress</AddrTypeCd>
								<Addr1>10 Apple Street</Addr1>
								<City>RENO</City>
								<StateProvCd>NV</StateProvCd>
								<PostalCode>89523</PostalCode>
							</Addr>
							<Communications>
								<PhoneInfo>
									<PhoneTypeCd>Phone</PhoneTypeCd>
									<PhoneNumber>+1-775-378-6114</PhoneNumber>
								</PhoneInfo>
								<EmailInfo>
									<CommunicationUseCd>Business</CommunicationUseCd>
									<EmailAddr>zachary@talageins.com</EmailAddr>
								</EmailInfo>
							</Communications>
						</GeneralPartyInfo>
						<InsuredOrPrincipalInfo>
							<InsuredOrPrincipalRoleCd>Insured</InsuredOrPrincipalRoleCd>
						</InsuredOrPrincipalInfo>
					</InsuredOrPrincipal>
					<Policy>
						<LOBCd>WORK</LOBCd>
						<ControllingStateProvCd>NV</ControllingStateProvCd>
						<ContractTerm>
							<EffectiveDt>2020-01-30</EffectiveDt>
							<ExpirationDt>2021-01-30</ExpirationDt>
						</ContractTerm>
						<BillingMethodCd>CAB</BillingMethodCd>
						<PaymentOption>
							<PaymentPlanCd>AP</PaymentPlanCd>
						</PaymentOption>
						<PolicySupplement>
							<LengthTimeInBusiness>
								<NumUnits>12</NumUnits>
								<UnitMeasurementCd>ANN</UnitMeasurementCd>
							</LengthTimeInBusiness>
						</PolicySupplement>
						<PolicyExt Domain="com.employers.digitalagencyservices.acordservice">
							<AddlEntity>NO</AddlEntity>
							<CustomerContact>Zachary Draper</CustomerContact>
							<InsuredClaim>NO</InsuredClaim>
						</PolicyExt>
					</Policy>
					<Location id="L1">
						<Addr>
							<AddrTypeCd>StreetAddress</AddrTypeCd>
							<Addr1>10 Apple Street</Addr1>
							<City>RENO</City>
							<StateProvCd>NV</StateProvCd>
							<PostalCode>89523</PostalCode>
						</Addr>
					</Location>
					<WorkCompLineBusiness>
						<LOBCd>WORK</LOBCd>
						<WorkCompRateState>
							<StateProvCd>NV</StateProvCd>
							<CreditOrSurcharge>
								<CreditSurchargeCd>EXP</CreditSurchargeCd>
								<NumericValue>
									<FormatModFactor>1</FormatModFactor>
								</NumericValue>
							</CreditOrSurcharge>
							<WorkCompLocInfo LocationRef="L1">
								<NumEmployees>2</NumEmployees>
								<WorkCompRateClass>
									<ActualRemunerationAmt>
										<Amt>72000</Amt>
									</ActualRemunerationAmt>
									<RatingClassificationCd>908201</RatingClassificationCd>
									<RatingClassificationDesc>Restaurant Employees</RatingClassificationDesc>
								</WorkCompRateClass>
							</WorkCompLocInfo>
						</WorkCompRateState>
						<Coverage>
							<CoverageCd>WCEL</CoverageCd>
							<Limit>
								<FormatCurrencyAmt>
									<Amt>1000000</Amt>
								</FormatCurrencyAmt>
								<LimitAppliesToCd>EachClaim</LimitAppliesToCd>
							</Limit>
							<Limit>
								<FormatCurrencyAmt>
									<Amt>1000000</Amt>
								</FormatCurrencyAmt>
								<LimitAppliesToCd>EachEmployee</LimitAppliesToCd>
							</Limit>
							<Limit>
								<FormatCurrencyAmt>
									<Amt>1000000</Amt>
								</FormatCurrencyAmt>
								<LimitAppliesToCd>PolicyLimit</LimitAppliesToCd>
							</Limit>
						</Coverage>
						<QuestionAnswer>
							<QuestionCd Domain="com.employers.digitalagencyservices.acordservice">EMPCO-316</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>BOP40</QuestionCd>
							<YesNoCd>YES</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>WORK06</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>WORK11</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>WORK11FiveEmp</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>GENRL06</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>WORK08</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>CGL04</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
						<QuestionAnswer>
							<QuestionCd>WORK07</QuestionCd>
							<YesNoCd>NO</YesNoCd>
						</QuestionAnswer>
					</WorkCompLineBusiness>
				</PolicyRq>
			</request>
		</wsdl:getWorkCompPolicy>
	</soapenv:Body>
</soapenv:Envelope>
